<h2 id="instructions-for-communicating-wsl2-ros-2-with-other-devices">Instructions for communicating WSL2 ROS 2 with other devices</h2>
<p>By default, WSL2 uses NAT, meaning it will have its own IP address different from Windows. This prevents your devices and WSL2 from being on the same subnet and communicating via multicast by default. The NAT will block some traffic, and discovery won&rsquo;t work. The DDS protocol, used by ROS2 to send packets, requires multicast, or you need to update it to unicast (specifying the IP of the node directly).</p>
<hr />
<h2 id="using-multicast">Using Multicast</h2>
<p>The &ldquo;Mirrored Networking&rdquo; mode, explained <a href="https://learn.microsoft.com/en-us/windows/wsl/networking#mirrored-mode-networking">here</a>, enables multicast support. This mode essentially allows WSL and Windows to share the same IP address.</p>
<p>To enable it:</p>
<ol type="1">
    <li>
        <p><strong>Create or update</strong> a <code>.wslconfig</code> file in Windows at <code>%UserProfile%\.wslconfig</code> with the following content:</p>
        <div id="cb1" class="sourceCode">
            <pre class="sourceCode ini"><code class="sourceCode ini"><span id="cb1-1"><a href="#cb1-1" aria-hidden="true"></a><span class="kw">[wsl2]</span></span>
<span id="cb1-2"><a href="#cb1-2" aria-hidden="true"></a><span class="dt">networkingMode</span><span class="ot">=</span><span class="st">mirrored</span></span></code></pre>
        </div>
    </li>
    <li>
        <p>To <strong>enable inbound packets</strong>, run the following in PowerShell:</p>
        <div id="cb2" class="sourceCode">
            <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb2-1"><a href="#cb2-1" aria-hidden="true"></a>Set-NetFirewallHyperVVMSetting -Name '{40E0AC32-46A5-438A-A0B2-2B479E8F2E90}' -DefaultInboundAction Allow</span></code></pre>
        </div>
        <p>This command modifies a specific setting on a Hyper-V virtual machine (VM) firewall to allow all inbound network traffic to the VM by default.</p>
        <ul>
            <li><code>Set-NetFirewallHyperVVMSetting</code>: This cmdlet modifies Hyper-V VM firewall settings.</li>
            <li><code>-Name '{%VM_GUID%}'</code>: This parameter specifies the VM to configure using its unique identifier (GUID or VM ID).</li>
            <li><code>-DefaultInboundAction Allow</code>: This parameter sets the default action for incoming network traffic to <code>Allow</code>, overriding the more secure default of blocking. This is often used in testing or troubleshooting to rule out firewall issues.</li>
        </ul>
    </li>
</ol>
<hr />
<p>After applying these changes, make sure to <strong>restart WSL completely or reboot your system</strong> for the settings to take effect. You should then see the same <code>inet</code> address when running <code>ifconfig</code> in WSL and <code>ipconfig</code> in Windows.</p>
<hr />
<p>To revert the command <code>Set-NetFirewallHyperVVMSetting -Name '{40E0AC32-46A5-438A-A0B2-2B479E8F2E90}' -DefaultInboundAction Allow</code>, you would use the same cmdlet but change the <code>-DefaultInboundAction</code> parameter to its original value, which is <strong>Block</strong>.</p>
<hr />
<h3 id="reverting-the-command">Reverting the Command</h3>
<p>The original command <strong>allowed</strong> all inbound traffic. To revert this, you need to change the action back to <strong>blocking</strong> inbound traffic by default. The command to do this is:</p>
<div id="cb3" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb3-1"><a href="#cb3-1" aria-hidden="true"></a>Set-NetFirewallHyperVVMSetting -Name '{40E0AC32-46A5-438A-A0B2-2B479E8F2E90}' -DefaultInboundAction Block</span></code></pre>
</div>
<ul>
    <li><code>Set-NetFirewallHyperVVMSetting</code>: This is the same cmdlet used to modify the firewall settings.</li>
    <li><code>-Name '{%VM_GUID%}'</code>: This parameter still targets the specific VM by its GUID.</li>
    <li><code>-DefaultInboundAction Block</code>: This parameter is changed to <strong>Block</strong>, which reverts the default behavior of the firewall to its more secure state, preventing all inbound traffic by default unless a specific rule allows it.</li>
</ul>
<hr />
<h2 id="troubleshooting">Troubleshooting</h2>
<p>If you get issues with the <code>ros2 node list</code>, <code>ros2 node list</code>, or other CLI command, it could be that the daemon service is not running. This command should fix it:</p>
<div id="cb4" class="sourceCode">
    <pre class="sourceCode bash"><code class="sourceCode bash"><span id="cb4-1"><a href="#cb4-1" aria-hidden="true"></a><span class="ex">ros2</span> daemon start</span></code></pre>
</div>
<p>If you still have issues detecting nodes on other machines, it is likely that the Windows firewall is blocking some of the traffic. Run these commands (in an administrator PowerShell) to make exceptions for ROS2 ports, and afterwards reboot your machine:</p>
<div id="cb5" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb5-1"><a href="#cb5-1" aria-hidden="true"></a>New-NetFirewallRule -DisplayName <span class="st">"ROS2 UDP 7400-7600"</span> -Direction Inbound -Action Allow -Protocol UDP -LocalPort 7400-7600 -Profile Private</span></code></pre>
</div>
<div id="cb6" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb6-1"><a href="#cb6-1" aria-hidden="true"></a>New-NetFirewallRule -DisplayName <span class="st">"ROS2 UDP 7400-7600 Outbound"</span> -Direction Outbound -Action Allow -Protocol UDP -LocalPort 7400-7600 -Profile Private</span></code></pre>
</div>
<hr />
<h2 id="instrucciones-para-comunicar-wsl2-ros-2-con-otros-dispositivos">Instrucciones para la comunicaci&oacute;n de WSL2 ROS 2 con otros dispositivos</h2>
<p>Por defecto, WSL2 utiliza NAT, lo que significa que tendr&aacute; su propia direcci&oacute;n IP diferente a la de Windows. Esto implica que sus otros dispositivos y WSL2 no estar&aacute;n en la misma subred y no podr&aacute;n comunicarse a trav&eacute;s de multidifusi&oacute;n por defecto. El NAT bloquear&aacute; parte del tr&aacute;fico y el descubrimiento no funcionar&aacute;. El protocolo DDS para enviar paquetes en ROS2 necesita multidifusi&oacute;n o debe actualizarlo a unidifusi&oacute;n (especificando directamente la IP del nodo).</p>
<hr />
<h2 id="uso-de-la-multidifusi&oacute;n">Uso de la multidifusi&oacute;n</h2>
<p>El modo de &ldquo;red en espejo&rdquo; explicado aqu&iacute; (<a href="https://www.google.com/search?q=https://learn.microsoft.com/es-es/windows/wsl/networking%23mirrored-mode-networking">https://learn.microsoft.com/es-es/windows/wsl/networking#mirrored-mode-networking</a>) habilitar&iacute;a este soporte. B&aacute;sicamente, WSL y Windows tendr&iacute;an la misma direcci&oacute;n IP.</p>
<p>Esto implica crear/actualizar un archivo <code>.wslconfig</code> en Windows: <code>%UserProfile%\.wslconfig</code> con el siguiente contenido:</p>
<div id="cb7" class="sourceCode">
    <pre class="sourceCode ini"><code class="sourceCode ini"><span id="cb7-1"><a href="#cb7-1" aria-hidden="true"></a><span class="kw">[wsl2]</span></span>
<span id="cb7-2"><a href="#cb7-2" aria-hidden="true"></a><span class="dt">networkingMode</span><span class="ot">=</span><span class="st">mirrored</span></span></code></pre>
</div>
<p>Para habilitar los paquetes entrantes, ejecute lo siguiente en PowerShell:</p>
<div id="cb8" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb8-1"><a href="#cb8-1" aria-hidden="true"></a>Set-NetFirewallHyperVVMSetting -Name '{40E0AC32-46A5-438A-A0B2-2B479E8F2E90}' -DefaultInboundAction Allow</span></code></pre>
</div>
<p>Este comando modifica una configuraci&oacute;n espec&iacute;fica en un firewall de m&aacute;quina virtual (VM) de Hyper-V. Permite todo el tr&aacute;fico de red entrante a la VM por defecto.</p>
<ul>
    <li><code>Set-NetFirewallHyperVVMSetting</code>: Este es el cmdlet (comando) principal que modifica la configuraci&oacute;n del firewall de la VM de Hyper-V.</li>
    <li><code>-Name '{%VM_GUID%}'</code>: Este par&aacute;metro especifica la VM en particular que desea configurar. La cadena larga de n&uacute;meros y letras entre llaves es el identificador &uacute;nico de la VM, tambi&eacute;n conocido como su GUID (Identificador &Uacute;nico Global) o ID de VM. Cada m&aacute;quina virtual tiene su propio GUID distinto.</li>
    <li><code>-DefaultInboundAction Allow</code>: Este par&aacute;metro establece la acci&oacute;n predeterminada para cualquier tr&aacute;fico de red entrante que no coincida con una regla de firewall espec&iacute;fica y m&aacute;s granular. Al establecerlo en <code>Allow</code>, est&aacute; abriendo la puerta a todas las conexiones entrantes a esa VM espec&iacute;fica, anulando el valor predeterminado m&aacute;s seguro de bloquear dicho tr&aacute;fico.</li>
</ul>
<p>En t&eacute;rminos simples, este comando es una excepci&oacute;n a la regla. En lugar de la medida de seguridad t&iacute;pica de bloquear el tr&aacute;fico entrante por defecto y solo permitir conexiones espec&iacute;ficas, este comando le dice al firewall que permita todo lo que entre para la VM identificada por ese c&oacute;digo &uacute;nico. Esto se utiliza a menudo en entornos de prueba o de laboratorio espec&iacute;ficos donde la seguridad es menos preocupante que la conectividad, o cuando se est&aacute; solucionando un problema de conexi&oacute;n y se quiere descartar el firewall como la causa.</p>
<hr />
<p>Aseg&uacute;rese de reiniciar WSL por completo o reiniciar el sistema, y deber&iacute;a tener todo habilitado. <code>ifconfig</code> e <code>ipconfig</code> deber&iacute;an mostrar la misma direcci&oacute;n <code>inet</code>.</p>
<h3 id="revertir-el-comando">Revertir el Comando</h3>
<p>El comando original <strong>permit&iacute;a</strong> todo el tr&aacute;fico entrante. Para revertir esto, debe cambiar la acci&oacute;n de nuevo a <strong>bloquear</strong> el tr&aacute;fico entrante por defecto. El comando para hacerlo es:</p>
<div id="cb9" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb9-1"><a href="#cb9-1" aria-hidden="true"></a>Set-NetFirewallHyperVVMSetting -Name '{40E0AC32-46A5-438A-A0B2-2B479E8F2E90}' -DefaultInboundAction Block</span></code></pre>
</div>
<ul>
    <li><code>Set-NetFirewallHyperVVMSetting</code>: Este es el mismo cmdlet utilizado para modificar la configuraci&oacute;n del firewall.</li>
    <li><code>-Name '{%VM_GUID%}'</code>: Este par&aacute;metro sigue apuntando a la VM espec&iacute;fica por su GUID.</li>
    <li><code>-DefaultInboundAction Block</code>: Este par&aacute;metro se cambia a <strong>Block</strong>, lo que revierte el comportamiento predeterminado del firewall a su estado m&aacute;s seguro, impidiendo todo el tr&aacute;fico entrante por defecto a menos que una regla espec&iacute;fica lo permita.</li>
</ul>
<h2 id="soluci&oacute;n-de-problemas">Soluci&oacute;n de Problemas</h2>
<p>Si tiene problemas con el comando <code>ros2 node list</code>, <code>ros2 topic list</code>, etc., podr&iacute;a ser que el servicio de demonio no se est&eacute; ejecutando. Este comando deber&iacute;a solucionarlo:</p>
<div id="cb10" class="sourceCode">
    <pre class="sourceCode bash"><code class="sourceCode bash"><span id="cb10-1"><a href="#cb10-1" aria-hidden="true"></a><span class="ex">ros2</span> daemon start</span></code></pre>
</div>
<p>Si a&uacute;n tiene problemas para detectar nodos en otras m&aacute;quinas, es probable que el firewall de Windows est&eacute; bloqueando parte del tr&aacute;fico. Ejecute estos comandos (en un PowerShell de administrador) para hacer excepciones para los puertos de ROS2, y luego reinicie su m&aacute;quina:</p>
<div id="cb11" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb11-1"><a href="#cb11-1" aria-hidden="true"></a>New-NetFirewallRule -DisplayName <span class="st">"ROS2 UDP 7400-7600"</span> -Direction Inbound -Action Allow -Protocol UDP -LocalPort 7400-7600 -Profile Private</span></code></pre>
</div>
<div id="cb12" class="sourceCode">
    <pre class="sourceCode powershell"><code class="sourceCode powershell"><span id="cb12-1"><a href="#cb12-1" aria-hidden="true"></a>New-NetFirewallRule -DisplayName <span class="st">"ROS2 UDP 7400-7600 Outbound"</span> -Direction Outbound -Action Allow -Protocol UDP -LocalPort 7400-7600 -Profile Private</span></code></pre>
</div>
<hr />